/**
  ******************************************************************************
  * @file    DeviceGlobalProtocol.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    04.04.2022
  * @brief   DeviceGlobalProtocol
  *          Часть объекта для глобального взаимодействия с устройством:
  ******************************************************************************
  */
#include "DeviceGlobal.hpp"

public :
  
  /**
   * @brief Инициализация протокола передачи данных
   */
  void initProtocol();

  /**
   * @brief Функция ответа датчику положения
   */
  void responseDP();

  private :
  
  /// Объект для реализации протокола передачи данных
  Protocol                      _protocol;
  
  /// Объект для управления выходом DE
  LogicOutput                   _logicOutputDE;
  
  /// Указатель на хэндл уарта
  UART_HandleTypeDef*           _uart;

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   25.02.2020    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */

