/**
  ******************************************************************************
  * @file    DeviceGlobalKernel.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    24.07.2022
  * @brief   DeviceGlobalKernel
  *          Часть объекта для глобального взаимодействия с устройством
  ******************************************************************************
  */
  
#include "DeviceGlobal.hpp"

  public :
  
  /**
   * @brief Инициализация ядра
   */
  void initKernel();
  
  private :
  
  /// Объект ядра устройства
  Kernel                        _kernel;
  
/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   10.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */

