/**
  ******************************************************************************
  * @file    ILed.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    23.07.2022
  * @brief   ILed
  *          Интерфейс управления светодидом
  ******************************************************************************
  */

#include "ILogicOutput.hpp"

#ifndef I_LED_HPP                                   //< Avoid multiple inclusion
#define I_LED_HPP

class ILed : public ILogicOutput {
  
  public:
  
  /**
   * @brief Метод интерфейса ILogicOutput
   *        Активировать логической выход.
   */  
  virtual void activate() = 0;
  
  /**
   * @brief Метод интерфейса ILogicOutput
   *        Деактивировать логической выход.
   */  
  virtual void deactivate() = 0;
  
  /**
   * @brief Активировать мигание
   */  
  virtual void blink() = 0;
  
  /**
   * @brief Активировать сигнальное мигание
   */  
  virtual void blinkAlarm() = 0;
  
  /**
   * @brief Активировать одноразовое мигание
   */  
  virtual void blinkOnce() = 0;
  
  enum State {
    STATE_INACTIVE,
    STATE_OFF,
    STATE_ON,
    STATE_BLINK,
    STATE_BLINK_ALARM,
    STATE_BLINK_ONCE,
  };
};

#endif  // I_LED_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   23.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
