/**
  ******************************************************************************
  * @file    ILogicOutput.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    10.07.2022
  * @brief   ILogicOutput
  *          Интерфейс управления выходом
  ******************************************************************************
  */

#ifndef I_LOGIC_OUTPUT_HPP                          //< Avoid multiple inclusion
#define I_LOGIC_OUTPUT_HPP

class ILogicOutput {
  
  public:
  
  /**
   * @brief Активировать логической выход
   */  
  virtual void activate() = 0;
  
  /**
   * @brief Деактивировать логической выход
   */  
  virtual void deactivate() = 0;
  
};

#endif  // I_LOGIC_OUTPUT_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   10.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
