/**
  ******************************************************************************
  * @file    ILogicInput.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    10.07.2022
  * @brief   ILogicInput
  *          Интерфейс управления выходом
  ******************************************************************************
  */

#ifndef I_LOGIC_INPUT_HPP                          //< Avoid multiple inclusion
#define I_LOGIC_INPUT_HPP

class ILogicInput {
  
  public:
  
  /**
   * @brief Получить состояние активации
   * @return Состояние активации
   */  
  virtual bool getActivation() = 0;
  
  /**
   * @brief Получить состояние длительной активации
   * @return Состояние длительной активации
   */  
  virtual bool getLongActivation() = 0;
  
};

#endif  // I_LOGIC_INPUT_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   10.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
