/**
  ******************************************************************************
  * @file    IObserver.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    08.07.2022
  * @brief   IObserver
  *          Интерфейс вызова периодических процедур
  ******************************************************************************
  */

#ifndef I_OBSERVER_HPP                              //< Avoid multiple inclusion
#define I_OBSERVER_HPP

class IObserver {
  
  public:
  
  /**
   * @brief Периодическая процедура
   */  
  virtual void observe() = 0;
  
};

#endif  // I_OBSERVER_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   08.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
