/**
  ******************************************************************************
  * @file    IPercent.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    24.07.2022
  * @brief   IPercent
  *          Интерфейс получения значения в процентах
  ******************************************************************************
  */

#ifndef I_PERCENT_HPP                               //< Avoid multiple inclusion
#define I_PERCENT_HPP

#include "stdint.h"

class IPercent {
  
  public:
  
  /**
   * @brief Получить значение в процентах
   * @return значение в процентах
   */  
  virtual float getPercent() = 0;
  
};

#endif  // I_PERCENT_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   24.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
