/**
  ******************************************************************************
  * @file    IPosition.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    10.07.2022
  * @brief   IPosition
  *          Интерфейс получения значения с датчика положения
  ******************************************************************************
  */

#ifndef I_POSITION_HPP                              //< Avoid multiple inclusion
#define I_POSITION_HPP

#include "stdint.h"

class IPosition {
  
  public:
  
  /**
   * @brief Получить код положения
   * @return код положения в HEX
   */  
  virtual uint16_t getPosition() = 0;
  
};

#endif  // I_POSITION_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   10.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
