/**
  ******************************************************************************
  * @file    IProcess.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    11.07.2022
  * @brief   IProcess
  *          Интерфейс выполнения операции
  ******************************************************************************
  */

#ifndef I_PROCESS_HPP                              //< Avoid multiple inclusion
#define I_PROCESS_HPP

class IProcess {
  
  public:
  
  /**
   * @brief Выполнить операцию
   */  
  virtual void process() = 0;
  
};

#endif  // I_PROCESS_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   11.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
