/**
  ******************************************************************************
  * @file    IStorage.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    18.07.2022
  * @brief   IStorage
  *          Интерфейс хранилища данных
  ******************************************************************************
  */

#ifndef I_STORAGE_HPP                               //< Avoid multiple inclusion
#define I_STORAGE_HPP

#include "stdint.h"

class IStorage {
  
  public:
  
  /**
   * @brief Записать значение регистра
   * @param number - номер регистра
   * @param value - значение регистра
   */  
  virtual void writeRegister(uint16_t number, uint16_t value) = 0;
  
  /**
   * @brief Считать значение регистра
   * @param number - номер регистра
   * @return значение регистра
   */  
  virtual uint16_t readRegister(uint16_t number) = 0;
  
};

#endif  // I_STORAGE_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   18.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
