/**
  ******************************************************************************
  * @file    ObjectsDefinitions.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    08.07.2022
  * @brief   ObjectsDefinitions
  *          Определение глобальных объектов устройства
  ******************************************************************************
  */

#ifndef _OBJECT_DEFINITIONS_HPP                     //< Avoid multiple inclusion
#define _OBJECT_DEFINITIONS_HPP

#include "DeviceGlobal.hpp"

extern DeviceGlobal* deviceGlobal;

#endif    // _OBJECT_DEFINITIONS_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   08.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
