/**
  ******************************************************************************
  * @file    EnumFlashRegisters.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    23.07.2022
  * @brief   EnumFlashRegisters
  *          Нумераторы для работы с регистрами Флеш памяти
  ******************************************************************************
  */

#ifndef ENUM_FLASH_REGISTERS_HPP                           //< Avoid multiple inclusion
#define ENUM_FLASH_REGISTERS_HPP

#include "stdint.h"

enum FlashRegister {
  FLASH_REG_CAL_VALUE_MIN = 0,
  FLASH_REG_CAL_VALUE_MAX,
  FLASH_REG_CAL_RANGE_MIN,
  FLASH_REG_CAL_RANGE_MAX,
  FLASH_REG_LIMIT,
};

#endif  // ENUM_FLASH_REGISTERS_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   23.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
