/**
  ******************************************************************************
  * @file    SemaphoreWrapper.hpp
  * @author  Мударисов Т.Р.
  * @version V1.0
  * @date    10.07.2022
  * @brief   SemaphoreWrapper
  *          Класс-обертка для семафора
  ******************************************************************************
  */

#ifndef SEMAPHORE_WRAPPER_HPP                       //< Avoid multiple inclusion
#define SEMAPHORE_WRAPPER_HPP

#include "cmsis_os.h"
  
class SemaphoreWrapper {
  
  public:
  
  /**
   * @brief Конструктор
   * @brief timeWait - время ожидания семафора
   */
  SemaphoreWrapper(uint32_t timeWait = osWaitForever);

  /**
   * @brief Ожидание установки семафора
   * @return результат установки по окончанию ожидания
   */
  bool wait();  

  /**
   * @brief Освобождение семафора
   * @return результат освобождения семафора
   */
  bool release();

  /**
   * @brief Установка времени ожидания семафора
   * @param msec - время в мс
   */
  void setTimeWait(uint32_t msec);
  
  private:
  
  /// Объект семафора
  osSemaphoreId     _semaphore;
  
  /// Время ожидания семафора
  uint32_t          _timeWait;
};

#endif //SEMAPHORE_WRAPPER_HPP

/**
  ******************************************************************************
  *  Вер. |   гггг-ммм-дд   | Внес изменения | Описание изменений
  *  =====|=================|================|==================================
  *   1.0 |   10.07.2022    | Мударисов Т.Р. | Первый релиз
  *  -----|-----------------|----------------|----------------------------------
  ******************************************************************************
  */
